app/Controllers/Course.php

SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
WHERE `courses`.`title` LIKE '%Data Science%' ESCAPE '!'
OR  `courses`.`description` LIKE '%Data Science%' ESCAPE '!'
---
    public function search()
    {
        $searchTerm = $this->request->getGet('search_term') ?? $this->request->getPost('search_term');

        if (!empty($searchTerm)) {
            $this->courseModel->select('courses.*, users.name as instructor_name');
            $this->courseModel->join('users', 'users.id = courses.instructor_id', 'left');
            $this->courseModel->like('courses.title', $searchTerm);
            $this->courseModel->orLike('courses.description', $searchTerm);
        } else {
            $this->courseModel->select('courses.*, users.name as instructor_name');
            $this->courseModel->join('users', 'users.id = courses.instructor_id', 'left');
        }

        $courses = $this->courseModel->findAll();