app/Models/CourseModel.php

SELECT *
FROM `courses`
WHERE `courses`.`id` = '1'
---
    public function getCourseById($id)
    {
        return $this->find($id);