app/Models/EnrollmentModel.php

INSERT INTO `enrollments` (`user_id`, `course_id`, `enrolled_at`) VALUES ('3', '1', '2025-10-10 17:26:49')
---
    public function enrollUser($data)
    {
        // Add current timestamp if not provided
        if (!isset($data['enrolled_at'])) {
            $data['enrolled_at'] = date('Y-m-d H:i:s');
        }

        return $this->insert($data);

SELECT `enrollments`.*, `courses`.`title`, `courses`.`description`, `courses`.`instructor_id`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '3'
---
    public function getUserEnrollments($user_id)
    {
        return $this->select('enrollments.*, courses.title, courses.description, courses.instructor_id')
                    ->join('courses', 'courses.id = enrollments.course_id')
                    ->where('enrollments.user_id', $user_id)
                    ->findAll();

SELECT *
FROM `enrollments`
WHERE `user_id` IS NULL
AND `course_id` = '1'
 LIMIT 1
---
    public function isAlreadyEnrolled($user_id, $course_id)
    {
        $enrollment = $this->where('user_id', $user_id)
                          ->where('course_id', $course_id)
                          ->first();

SELECT `course_id`
FROM `enrollments`
WHERE `user_id` = '3'
SELECT `courses`.*
FROM `courses`
---
    public function getAvailableCourses($user_id)
    {
        $db = \Config\Database::connect();

        // Get enrolled course IDs first
        $enrolledCourseIds = $db->table('enrollments')
                               ->select('course_id')
                               ->where('user_id', $user_id)
                               ->get()
                               ->getResultArray();

        // Extract just the IDs
        $enrolledIds = array_column($enrolledCourseIds, 'course_id');

        // Get courses not in the enrolled list
        $builder = $db->table('courses')->select('courses.*');

        if (!empty($enrolledIds)) {
            $builder->whereNotIn('courses.id', $enrolledIds);
        }

        return $builder->get()->getResultArray();